<img src="https://raw.githubusercontent.com/dm-fedorov/pandas_basic/master/pic/currency_cleanup.png">

In [34]:
# df["Sales"].astype('float') Метод не работает не удеться преобразовать строку в чсло с плавающий точкой 

# dir(df["Sales"])

In [37]:
df = df_orig.copy()

df['Sales'] = df['Sales'].str.replace(',', '')
df['Sales'] = df['Sales'].str.replace('$', '')

df['Sales']

0        NaN
1    1000.00
2        NaN
3     750.01
4        NaN
5        NaN
Name: Sales, dtype: object

In [39]:
df = df_orig.copy()

df['Sales'].apply(type)

0      <class 'int'>
1      <class 'str'>
2    <class 'float'>
3      <class 'str'>
4      <class 'int'>
5      <class 'int'>
Name: Sales, dtype: object

**Код apply(type) выполняет функцию type для каждого значения в столбце**

In [55]:
df['Sales_Type'] = df['Sales'].apply(lambda x: type(x).__name__)

df

         Customer      Sales Sales_Type
0  Jones Brothers        500        int
1       Beta Corp  $1,000.00        str
2     Globex Corp      300.1      float
3            Acme    $750.01        str
4         Initech        300        int
5           Hooli        250        int

In [56]:
df['Sales'].apply(type).value_counts()

Sales
<class 'int'>      3
<class 'str'>      2
<class 'float'>    1
Name: count, dtype: int64